In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel('phone.xlsx',index_col=0)
df1

               name address where   tel
company
山西沁水新奥清洁能源有限公司   张三      长治     屯留    1
新地能源工程技术有限公司     李四      沁水     嘉丰    2
沁水县晶安工贸有限公司      王武      阳城     蟒河    3

In [3]:
df2 = pd.read_excel('data.xls', index_col=0)
df2

      tel
name
张三      0
李四      1
王五      2

In [18]:
tel_2 = df2['tel'].tolist()
tel_2

[0, 1, 2]

In [19]:
df3 = df1[df1['tel'].isin(tel_2)]
df3

               name address where   tel
company
山西沁水新奥清洁能源有限公司   张三      长治     屯留    1
新地能源工程技术有限公司     李四      沁水     嘉丰    2

In [15]:
df1['tel'].dtypes

dtype('int64')

In [6]:
df3.to_excel('tb.xlsx', sheet_name='tb1')